{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"frame_i1:0": {"name": "frame_i1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "frame_i2:0": {"name": "frame_i2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}, {"size": "1"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "51"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "51"}, {"size": "1"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "51"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "frame_i1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "frame_i2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["frame_i1", "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["frame_i2", "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise_1", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise", "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise_1/ReadVariableOp", "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise_1", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise", "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise_1/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise/ReadVariableOp", "shape": [51, 1, 3, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I1_1/depthwise_1/ReadVariableOp", "shape": [1, 51, 3, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise/ReadVariableOp", "shape": [51, 1, 3, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SepConv_Interpolation_1/sepconv_I2_1/depthwise_1/ReadVariableOp", "shape": [1, 51, 3, 1], "dtype": "float32"}]}]}